In [1]:
import pandas as pd
import numpy as np

In [7]:
car_sales = pd.read_csv("../data/car-sales.csv")
cars_ext = pd.read_csv("../data/car-sales-extended.csv")

### 1. If you want to install any packages within the notebook

In [ ]:
# Install Seaborn package in current environment (if you don't have it)
import sys
#!conda install --yes --prefix {sys.prefix} seaborn

### 2. Working with dates

In [ ]:
df_date = pd.read_csv("../data/bluebook-for-bulldozers/TrainAndValid.csv",
                 low_memory=False,
                 parse_dates=["saledate"])
# Acess the `saledate` column with saledate.dt.day to get the date, and so on

### 3. Sorting Values

In [ ]:
# Sort DataFrame in date order
df_date.sort_values(by=["saledate"], inplace=True, ascending=True)

### 4. Check How Many Values Are There In A  Particular Column

In [3]:
car_sales.Make.value_counts(),car_sales.Price.value_counts()

(Toyota    4
 Honda     3
 Nissan    2
 BMW       1
 Name: Make, dtype: int64,
 $7,000.00     2
 $22,000.00    1
 $7,500.00     1
 $9,700.00     1
 $5,000.00     1
 $4,500.00     1
 $4,000.00     1
 $6,250.00     1
 $3,500.00     1
 Name: Price, dtype: int64)

### 5. To Check Which Dtype is it?

In [4]:
# Here checking whether it is string or not
pd.api.types.is_string_dtype(car_sales["Price"])

True

In [5]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

### 6.To Convert String To Float

In [6]:
car_sales.Price = car_sales.Price.str.replace('[$,]','').astype(float)

---

## `loc` and `iloc`

In [9]:
car_sales.iloc[[0,2,3],0]

0    Toyota
2    Toyota
3       BMW
Name: Make, dtype: object

### 7. Groupby

In [7]:
car_sales.groupby("Make")['Price'].max()

Make
BMW       22000.0
Honda      7500.0
Nissan     9700.0
Toyota     7000.0
Name: Price, dtype: float64

In [8]:
car_sales.groupby("Price").sum()

         Odometer (KM)  Doors
Price
3500.0          213095      4
4000.0          150043      4
4500.0           99213      4
5000.0           87899      4
6250.0           60000      4
7000.0           87287      7
7500.0           45698      4
9700.0           31600      4
22000.0          11179      5

In [9]:
car_sales.groupby(["Price"]).min()

'''So what has happened here? This grops our data frame wrt to Price. Applies min()
to all other numeric columns. Here under 7K category Toyota and Honda produced cars 3 and 4 Doors respectively. 
So under 7k, Doors are displayed as 3 (3<4) and make as Honda since Honda < Toyota (PROOF BELOW!)'''

'So what has happened here? This grops our data frame wrt to Price. Applies min()\nto all other numeric columns. Here under 7K category Toyota and Honda produced cars 3 and 4 Doors respectively. \nSo under 7k, Doors are displayed as 3 (3<4) and make as Honda since Honda < Toyota (PROOF BELOW!)'

In [10]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [11]:
if('Honda' < 'Toyota'):
    print(True)

True

### 8. Info. The info() function is used to print a concise summary of a DataFrame. This method prints information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage.

In [12]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

### 9. items

In [13]:
car_sales.items

<bound method DataFrame.items of      Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0>

#### Wondering what `items` is performing? Imagine a dictionay. Its a `key:value` pair. The `items` takes in the dictionary

In [14]:
# Lets see an example
rdict = {1:"A",
         2:"B",
         3:"C"}
for label,content in car_sales.items():
    print(label)# See this prints all the column names

Make
Colour
Odometer (KM)
Doors
Price

In [15]:
for label,content in car_sales.items():
    print(content)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object
0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object
0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64
0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64
0     4000.0
1     5000.0
2     7000.0
3    22000.0
4     3500.0
5     4500.0
6     7500.0
7     7000.0
8     6250.0
9     9700.0
Name: Price, dtype: float64

### 10. Converting one datatype into `CATEGORICAL`

In [16]:
# Lets convert "Make" into category
car_sales_copy = car_sales.copy()

In [17]:
car_sales_copy["Make"] = car_sales_copy["Make"].astype("category").cat.as_ordered()

In [18]:
car_sales_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     category
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     float64
dtypes: category(1), float64(1), int64(2), object(1)
memory usage: 650.0+ bytes

In [19]:
car_sales_copy.Make.cat.categories

Index(['BMW', 'Honda', 'Nissan', 'Toyota'], dtype='object')

### 12. To See The Category Codes

In [20]:
car_sales_copy.Make.cat.codes

0    3
1    1
2    3
3    0
4    2
5    3
6    1
7    1
8    3
9    2
dtype: int8

### 13. Check `Missing` Values

In [21]:
# Check missing values
car_sales_copy.isna().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

### 14. Feature Importance

In [ ]:
trained_model.feature_importances_

### 15. DataFrame From Scratch
### Series is a 1-D Structure i.e `COLUMN` only.
### DataFrame is a 2-D Structure , have both `COLUMNS & ROWS`
First of lets see how to make a single column df

In [22]:
data = ["Ab","Cd","Ef","Gh","Ij","Kl","Mn","Op","Qr","St"]

In [23]:
df_t = pd.DataFrame()

In [24]:
pd.Series(data)

0    Ab
1    Cd
2    Ef
3    Gh
4    Ij
5    Kl
6    Mn
7    Op
8    Qr
9    St
dtype: object

In [25]:
df_t["Assembled"] = pd.Series(data)

In [26]:
df_t

  Assembled
0        Ab
1        Cd
2        Ef
3        Gh
4        Ij
5        Kl
6        Mn
7        Op
8        Qr
9        St

In [27]:
df_t.reset_index()

   index Assembled
0      0        Ab
1      1        Cd
2      2        Ef
3      3        Gh
4      4        Ij
5      5        Kl
6      6        Mn
7      7        Op
8      8        Qr
9      9        St

###### Let's  make a complete DataFrame now

In [28]:
# The general format is pd.DataFrame(data,,index(optional))
cdf = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['Q','W','E','R'])

In [29]:
cdf

          Q         W         E         R
A -1.044070  1.145838  1.317435  0.725956
B -0.325615  1.456701 -0.369217  1.157372
C  0.454535  0.356722 -1.614082  0.170581
D -0.066154  2.744469  0.315015 -1.588787
E  0.327292  2.710805 -0.512916 -1.644800

In [31]:
cdf.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

### DF From a Dictionary

In [32]:
animal_sounds = {"Cat":"Meow",
                 "Dog" : "Bark",
                 "Donkey":"Bray",
                 "Lion":"Roar"}
animals = pd.DataFrame(animal_sounds,index=[0,1,2,3,4])

In [33]:
animals

    Cat   Dog Donkey  Lion
0  Meow  Bark   Bray  Roar
1  Meow  Bark   Bray  Roar
2  Meow  Bark   Bray  Roar
3  Meow  Bark   Bray  Roar
4  Meow  Bark   Bray  Roar

In [35]:
animals.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

### Alter

In [36]:
foods = pd.Series(["Almond butter", "Eggs", "Avocado"])
prices = pd.Series([9, 6, 2])

In [37]:
food = pd.DataFrame({"Foods": foods,
                     "Prices": prices})
food

           Foods  Prices
0  Almond butter       9
1           Eggs       6
2        Avocado       2

## `index_col`

In [3]:
indexed_df = pd.DataFrame({"Index":[1,2,3],"Name":["A","B","C"],"Age":[1,2,3]})

In [4]:
indexed_df

   Index Name  Age
0      1    A    1
1      2    B    2
2      3    C    3

### See here we are already having an index column at 0. So lets use it
use `index_col=0` while reading it back from a csv file

In [ ]:
wine_reviews = pd.read_csv("../input/wine-reviews/winemag-data-130k-v2.csv", index_col=0

## 16. Reseting Index
Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.

In [38]:
car_sales_copy.reset_index()

   index    Make Colour  Odometer (KM)  Doors    Price
0      0  Toyota  White         150043      4   4000.0
1      1   Honda    Red          87899      4   5000.0
2      2  Toyota   Blue          32549      3   7000.0
3      3     BMW  Black          11179      5  22000.0
4      4  Nissan  White         213095      4   3500.0
5      5  Toyota  Green          99213      4   4500.0
6      6   Honda   Blue          45698      4   7500.0
7      7   Honda   Blue          54738      4   7000.0
8      8  Toyota  White          60000      4   6250.0
9      9  Nissan  White          31600      4   9700.0

## 17. Merging

`Merging can only be done when both the dfs have a same column name or by specifying the column names

In [39]:
# Let's merge df_t & car_sales_copy
df_t.reset_index(inplace=True)

In [40]:
car_sales_copy.reset_index(inplace=True)

In [41]:
df_t , car_sales_copy

(   index Assembled
 0      0        Ab
 1      1        Cd
 2      2        Ef
 3      3        Gh
 4      4        Ij
 5      5        Kl
 6      6        Mn
 7      7        Op
 8      8        Qr
 9      9        St,
    index    Make Colour  Odometer (KM)  Doors    Price
 0      0  Toyota  White         150043      4   4000.0
 1      1   Honda    Red          87899      4   5000.0
 2      2  Toyota   Blue          32549      3   7000.0
 3      3     BMW  Black          11179      5  22000.0
 4      4  Nissan  White         213095      4   3500.0
 5      5  Toyota  Green          99213      4   4500.0
 6      6   Honda   Blue          45698      4   7500.0
 7      7   Honda   Blue          54738      4   7000.0
 8      8  Toyota  White          60000      4   6250.0
 9      9  Nissan  White          31600      4   9700.0)

### See both the dfs have a common column called `index`

In [42]:
# Let's merge them
merged = pd.merge(car_sales_copy,df_t,on="index")

#### The last arg `on=` is used when the 2 dfs have a common column. If it doesnt have a common column,
#### then we have to specify by `right_on=` and `left_on=`

In [43]:
merged.drop('index',axis=1)

     Make Colour  Odometer (KM)  Doors    Price Assembled
0  Toyota  White         150043      4   4000.0        Ab
1   Honda    Red          87899      4   5000.0        Cd
2  Toyota   Blue          32549      3   7000.0        Ef
3     BMW  Black          11179      5  22000.0        Gh
4  Nissan  White         213095      4   3500.0        Ij
5  Toyota  Green          99213      4   4500.0        Kl
6   Honda   Blue          45698      4   7500.0        Mn
7   Honda   Blue          54738      4   7000.0        Op
8  Toyota  White          60000      4   6250.0        Qr
9  Nissan  White          31600      4   9700.0        St

### 18. Joining
The join method takes two dataframes and `joins them on their indexes` (technically, you can pick the column to join on for the left dataframe)

In [48]:
# Dataframe of number of sales made by an employee
sales = {'Tony': 103,
         'Sally': 202,
         'Randy': 380,
         'Ellen': 101,
         'Fred': 82
        }
# Dataframe of all employees and the region they work in
region = {'Tony': 'West',
          'Sally': 'South',
          'Carl': 'West',
          'Archie': 'North',
          'Randy': 'East',
          'Ellen': 'South',
          'Fred': np.nan,
          'Mo': 'East',
          'HanWei': np.nan,
         }

In [49]:
sales_df = pd.DataFrame.from_dict(sales, orient='index', 
                                  columns=['sales'])
'''orient{‘columns’, ‘index’}, default ‘columns’
The “orientation” of the data. If the keys of the passed dict should be the columns of the resulting DataFrame, pass ‘columns’ (default). 
Otherwise if the keys should be rows, pass ‘index’.'''

In [50]:
sales_df

       sales
Tony     103
Sally    202
Randy    380
Ellen    101
Fred      82

In [51]:
region_df = pd.DataFrame.from_dict(region, orient='index', 
                                   columns=['region'])

In [52]:
region_df

       region
Tony     West
Sally   South
Carl     West
Archie  North
Randy    East
Ellen   South
Fred      NaN
Mo       East
HanWei    NaN

In [63]:
joined_df = region_df.join(sales_df, how='inner')

In [64]:
joined_df

      region  sales
Tony    West    103
Sally  South    202
Randy   East    380
Ellen  South    101
Fred     NaN     82